<?php 

// question 1
// 変数$i = 100; を用意し、100から1まで1つずつカウントダウンするプログラムを作成してください。 （1つずつ改行して表示して下さい）

// question 2
// 正の整数1から9に、それぞれ3を掛けた数を半角スペース区切りで出力して下さい。

// question 3
// 1から100までの数をプリントするプログラムを書きなさい。 ただし3の倍数のときは数の代わりに｢Fizz｣と、5の倍数のときは｢Buzz｣とプリントし、3と5両方の倍数の場合には｢FizzBuzz｣とプリントすること。

// question 4
// 1〜100までの数字を表示させるプログラムを作りましょう。 ※出力のレイアウトは,数字を10個表示したタイミングで改行する。

// question 5
// 下記のような配列変数「alpha」があります。この配列のうち、'A'という文字が何回登場してくるか計算して結果を出力してください。
// $alpha = array('E', 'A', 'D', 'B', 'A', 'C', 'A', 'B', 'E', 'E', 'A', 'A', 'C');